---
kind: method
id: M:Autodesk.Revit.DB.CurveArray.ReverseIterator
source: html/ccc74210-38ce-3cf2-2174-73389f1f3228.htm
---
# Autodesk.Revit.DB.CurveArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual CurveArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.